#### DockablePanes Class

---

|  |
| --- |
| See Also |

Provides a container of all Revit built-in DockablePaneId instances.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class DockablePanes ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class DockablePanes ``` |

| Visual C++ |
| --- |
| ``` public ref class DockablePanes abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.UI DockablePanes

# See Also

Autodesk.Revit.UI Namespace